SpenceKonde/DxCore/megaavr/variants/32pin-easeries/pins_arduino.h
/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
  #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
    PIN0_bp,//   0 PA0
  #else
    NOT_A_PIN,
  #endif
  PIN1_bp, // *INDENT-ON*
  PIN2_bp,   //  2 PA2/SDA
  PIN3_bp,   //  3 PA3/SCL
  PIN4_bp,   //  4 PA4/MOSI
  PIN5_bp,   //  5 PA5/MISO
  PIN6_bp,   //  6 PA6/SCK
  PIN7_bp,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
  PIN0_bp,   //  8 PC0/AIN28
  PIN1_bp,   //  9 PC1/AIN29
  PIN2_bp,   // 10 PC2/AIN30
  PIN3_bp,   // 11 PC3/AIN31
  PIN0_bp,   // 12 PD0/AIN0
  PIN1_bp,   // 13 PD1/AIN1
  PIN2_bp,   // 14 PD2/AIN2
  PIN3_bp,   // 15 PD3/AIN3
  PIN4_bp,   // 16 PD4/AIN4
  PIN5_bp,   // 17 PD5/AIN5
  PIN6_bp,   // 18 PD6/AIN6
  PIN7_bp,   // 19 PD7/AIN7/AREF
  PIN0_bp,   // 20 PF0/TOSC1/AIN16
  PIN1_bp,   // 21 PF1/TOSC2/AIN17
  PIN2_bp,   // 22 PF2/AIN18
  PIN3_bp,   // 23 PF3/AIN19
  PIN4_bp,   // 24 PF4/AIN20
  PIN5_bp,   // 25 PF5/AIN21
  PIN6_bp,   // 26 PF6 RESET
  PIN7_bp    // 27 PD7 UPDI
};

const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
  #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
    PIN0_bm,//   0 PA0
  #else
    NOT_A_PIN,
  #endif
  PIN1_bm,//   1 PA1
  PIN2_bm,   //  2 PA2/SDA
  PIN3_bm,   //  3 PA3/SCL
  PIN4_bm,   //  4 PA4/MOSI
  PIN5_bm,   //  5 PA5/MISO
  PIN6_bm,   //  6 PA6/SCK
  PIN7_bm,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
  PIN0_bm,   //  8 PC0/USART1_Tx
  PIN1_bm,   //  9 PC1/USART1_Rx
  PIN2_bm,   // 10 PC2
  PIN3_bm,   // 11 PC3
  PIN0_bm,   // 12 PD0/AIN0
  PIN1_bm,   // 13 PD1/AIN1
  PIN2_bm,   // 14 PD2/AIN2
  PIN3_bm,   // 15 PD3/AIN3
  PIN4_bm,   // 16 PD4/AIN4
  PIN5_bm,   // 17 PD5/AIN5
  PIN6_bm,   // 18 PD6/AIN6
  PIN7_bm,   // 19 PD7/AIN7/AREF
  PIN0_bm,   // 20 PF0/TOSC1
  PIN1_bm,   // 21 PF1/TOSC2
  PIN2_bm,   // 22 PF2
  PIN3_bm,   // 23 PF3
  PIN4_bm,   // 24 PF4
  PIN5_bm,   // 25 PF5
  PIN6_bm,   // 26 PF6 RESET
  PIN7_bm    // 27 PF7 UPDI
};

const uint8_t digital_pin_to_timer[] = {
  /* TCE0 Not covered because it is on every pin except reset and UPDI
   * Will need to be treated like TCA is                               */
  NOT_ON_TIMER, //  0 PA0/USART0_Tx/CLKIN
  NOT_ON_TIMER, //  1 PA1/USART0_Rx
  TIMERB0,      //  2 PA2/SDA/AIN22
  TIMERB1,      //  3 PA3/SCL/AIN23
  NOT_ON_TIMER, //  4 PA4/MOSI/AIN24
  NOT_ON_TIMER, //  5 PA5/MISO/AIN25
  NOT_ON_TIMER, //  6 PA6/SCK/AIN26
  NOT_ON_TIMER, //  7 PA7/SS/CLKOUT/AIN27
  TIMERB2,      //  8 PC0/AIN28
  TIMERR3,      //  9 PC1/AIN29
  NOT_ON_TIMER, // 10 PC2/AIN30
  NOT_ON_TIMER, // 11 PC3/AIN31
  NOT_ON_TIMER, // 12 PD0/AIN0
  NOT_ON_TIMER, // 13 PD1/AIN1
  NOT_ON_TIMER, // 14 PD2/AIN2
  NOT_ON_TIMER, // 15 PD3/AIN3
  NOT_ON_TIMER, // 16 PD4/AIN4
  NOT_ON_TIMER, // 17 PD5/AIN5
  DACOUT,       // 18 PD6/AIN6
  NOT_ON_TIMER, // 19 PD7/AIN7/AREF
  NOT_ON_TIMER, // 20 PF0/TOSC1/AIN16
  NOT_ON_TIMER, // 21 PF1/TOSC2/AIN17
  NOT_ON_TIMER, // 22 PF2/AIN18
  NOT_ON_TIMER, // 23 PF3/AIN19
  NOT_ON_TIMER, // 24 PF4/AIN20
  NOT_ON_TIMER, // 25 PF5/AIN21
  NOT_ON_TIMER, // 26 PF6 RESET
  NOT_ON_TIMER  // 27 PF7 UPDI
};

#endif
  // These are used for CI testing. They should *not* *ever* be used except for CI-testing where we need to pick a viable pin to compile a sketch with that won't generate compile errors (we don't care whether it would;d actually work, we are concerned with )
  #if CLOCK_SOURCE != 0
    #define _VALID_DIGITAL_PIN(pin)  ((pin) >= && (pin) < 4 ? ((pin) + 2)
  #else
    #define _VALID_DIGITAL_PIN(pin)  ((pin) >= && (pin) < 4 ? ((pin) + 0 ): NOT_A_PIN)
  #endif
  #define    _VALID_ANALOG_PIN(pin)  ((pin) >= 0 && ((pin) <= 4) ?                     ((pin) + PIN_PD1) : NOT_A_PIN)
#endif
